pmo-dataset/variations/mermaid_basic/16.mmd
graph LR
	ExclusiveGateway_5{"X"} --> ExclusiveGateway_8{"X"}
	Task_2["Approve report"] --> Task_21["Distribute final report"]
	ExclusiveGateway_4{"X"} --> ParallelGateway_1{"+"}
	ParallelGateway_6{"+"} --> Task_11["Check regulatory updates"]
	Task_11 --> ParallelGateway_2{"+"}
	Task_23["Request clarifications of discrepancies"] --> Task_16["Receive clarifications"]
	Task_14["Evaluate financial risks"] --> ParallelGateway_3{"+"}
	Task_17["Prepare financial statements"] --> ParallelGateway_2
	ExclusiveGateway_5 --> Task_5["Launch detailed investigation"]
	ParallelGateway_4{"+"} --> ExclusiveGateway_7{"X"}
	Task_5 --> ParallelGateway_4
	ParallelGateway_4 --> Task_10["Conduct interviews"]
	ParallelGateway_5{"+"} --> ExclusiveGateway_8
	Task_24["Evaluate operational risks"] --> ParallelGateway_3
	ExclusiveGateway_7 --> Task_19["Perform site visits"]
	ParallelGateway_6 --> Task_17
	ParallelGateway_4 --> Task_22["Conduct data analysis"]
	Task_13["Evaluate compliance risks"] --> ParallelGateway_3
	Task_16 --> ExclusiveGateway_4
	StartEvent_1(("start")) --> Task_4["Send notification"]
	Task_7["Gather necessary documents"] --> ParallelGateway_2
	ExclusiveGateway_1{"X"} --> ParallelGateway_5
	ParallelGateway_6 --> Task_7
	Task_22 --> ParallelGateway_5
	ExclusiveGateway_7 --> ExclusiveGateway_1
	Task_10 --> ParallelGateway_5
	ExclusiveGateway_3{"X"} --> Task_2
	ExclusiveGateway_8 --> Task_18["Complete risk assessment/mitigation"]
	ParallelGateway_1 --> Task_14
	Task_8["Send report for revision"] --> Task_12["Update and resubmit report"]
	ParallelGateway_1 --> Task_13
	ExclusiveGateway_6{"X"} --> Task_23
	Task_4 --> ParallelGateway_6
	ParallelGateway_1 --> Task_24
	Task_6["Close audit process"] --> EndEvent_1(("end"))
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ParallelGateway_2 --> Task_1["Submit documents"]
	Task_21 --> Task_3["Archive report"]
	ExclusiveGateway_3 --> Task_8
	Task_19 --> ExclusiveGateway_1
	Task_3 --> Task_6
	ExclusiveGateway_2{"X"} --> Task_20["Review report by audit director"]
	Task_15["Review submission"] --> ExclusiveGateway_6
	Task_18 --> Task_9["Compile audit report"]
	ParallelGateway_3 --> ExclusiveGateway_5
	Task_20 --> ExclusiveGateway_3
	Task_1 --> Task_15
	Task_9 --> ExclusiveGateway_2
	Task_12 --> ExclusiveGateway_2
